---
kind: type
id: T:Autodesk.Revit.DB.LinePatternElement
source: html/8f4678ba-1824-fd00-73b6-dfb9c7802f83.htm
---
# Autodesk.Revit.DB.LinePatternElement

An element that represents a line pattern.

## Syntax (C#)
```csharp
public class LinePatternElement : Element
```

## Remarks
The LinePatternElement represents a line pattern in a project.
 It enables the user to retrieve, modify or create a line pattern in a project.